УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_НастройкиПодписания/КонтурЛогистика_НастройкиПодписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиПодписания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдалитьОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>Используется только если не настроена должность в сертификате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьМЧД</name>
    <comment>Единый регистрационный номер доверенности, Уникальный идентификатор доверенности в виде 36-разрядного GUID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИдСистХран</name>
    <comment>ИдСистХран - Идентифицирующие сведения об информационной системе, в которой хранится доверенность, используемая для подтверждения полномочий в электронной форме (СвСистХран для некоторых сообщений)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписанта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </resources>
  <resources>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОрганизация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИздатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыпускаМЧД</name>
    <comment>в драфте 5.02 более нет необходимости указывать дату доверки в титуле</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ДатаДовер</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ВнНомДовер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьТипМодуляКриптографии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИмяМодуляКриптографии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВводитьПарольВПрограммеЭлектроннойПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_СертификатыЭлектроннойПодписи</types>
    </type>
  </resources>
  <resources>
    <name>МЧД</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_МЧД</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертификатБезМЧД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопСведенияОПодписанте</name>
    <comment>Дополнительные сведения о подписанте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСтатусаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>taskIdRegisterPOA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВалидации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь1С</name>
    <comment>не заполнен - общее значение для организации</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СертификатНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопПараметр</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      <types>EnumRef.КонтурЛогистика_ТипыПрокси</types>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>EnumRef.КонтурЛогистика_ЕдиницыИзмеренияГСМ</types>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
      <types>EnumRef.КонтурЛогистика_ТипыТранспортныхСредств</types>
      <types>EnumRef.КонтурЛогистика_ФункцииЗаказаЗаявки</types>
      <types>CatalogRef.Валюты</types>
      <types>EnumRef.КонтурЛогистика_МастерДанныеСотрудников</types>
      <types>CatalogRef.Контрагенты</types>
      <types>EnumRef.КонтурЛогистика_СпособыПередачиМЧД</types>
      <types>Boolean</types>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      <types>EnumRef.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД</types>
      <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
      <types>CatalogRef.Организации</types>
      <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
      <types>EnumRef.КонтурЛогистика_ТипыПМ</types>
      <types>String</types>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>EnumRef.КонтурЛогистика_РежимыАвторизации</types>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.КонтурЛогистика_СпособыСопоставленияТоваровТитул3</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.Партнеры</types>
      <types>EnumRef.КонтурЛогистика_СценарииПодписанияТитулов</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>EnumRef.КонтурЛогистика_ВариантыВалидации</types>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
      <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
      <types>EnumRef.КонтурЛогистика_ТипыСопроводительныхДокументов</types>
      <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
      <types>CatalogRef.ЗоныДоставки</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_НастройкиПодписания/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	ТекПользовательПродвинутый = (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или РольДоступна("КонтурЛогистика_НастройкаПодписания"));
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		//это пустой набор записей, т.е. удаление записей
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		Если Не ТекПользовательПродвинутый Тогда 
			Отказ = Истина;
			ВызватьИсключение("Удаление настроек подписания разрешено только администратору");
		КонецЕсли;
	КонецЕсли;
	
	Для каждого ТекЗапись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(ТекЗапись.ОрганизацияДиадок) Тогда 
			Сообщить("С версии 0.6.0 обязательно указывать организацию");
			Отказ = Истина;
		КонецЕсли;	
		
		//Если ЗначениеЗаполнено(ТекЗапись.УдалитьМЧД)
		//	И не ЗначениеЗаполнено(ТекЗапись.УдалитьДатаВыпускаМЧД) Тогда 
		//	Сообщить("До перехода на формат ФНС транспортной накладной 5.02 обязательно указывать дату выпуска МЧД");
		//	Отказ = Истина;
		//КонецЕсли;	
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() = "Файловая" 
			И ТекЗапись.СертификатНаСервере Тогда 
			
			Сообщить("НЕВОЗМОЖНО использовать серверный сертификат в файловой базе: " + ТекЗапись.УдалитьОтпечатокСертификата);
			Отказ = Истина;
			
			Прервать;
			
		КонецЕсли;	
		
		Если Не ТекПользовательПродвинутый Тогда 
			
			Если ТекЗапись.Пользователь1С <> КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С() Тогда 
				Отказ = Истина;
				ВызватьИсключение("Пользователи НЕ администраторы подсистемы Логистика могут настраивать подписание только для себя");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
			
	Если Не Отказ Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
		
	КонецЕсли;	
	
КонецПроцедуры
